In [19]:
import pandas as pd
series1 = pd.Series([1,2,3,4,5,6])
series1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [20]:
series2 = pd.Series([1,2,3,4,5,6], index=['a','b','c','d','e','f'])
series2

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [21]:
series2.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [22]:
series2['a']

1

In [23]:
series2[['a','c']]

a    1
c    3
dtype: int64

In [30]:
d = {'a':'big','b':'small'}
s = pd.Series(d)
s

a      big
b    small
dtype: object

In [32]:
d = {'a':'big','b':'small'}
s = pd.Series(d, index = ['a','b','c'])
s

a      big
b    small
c      NaN
dtype: object

In [34]:
dict = {'name':['aa','bb','cc','dd'],
       'sex':['男','男','男','女'],
       'score':[76,78,64,80]}
df = pd.DataFrame(dict)
df

  name sex  score
0   aa   男     76
1   bb   男     78
2   cc   男     64
3   dd   女     80

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
name     4 non-null object
sex      4 non-null object
score    4 non-null int64
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [36]:
df['sex']

0    男
1    男
2    男
3    女
Name: sex, dtype: object

In [37]:
df.sex

0    男
1    男
2    男
3    女
Name: sex, dtype: object

In [39]:
df.iloc[0]

name     aa
sex       男
score    76
Name: 0, dtype: object

In [40]:
df[0:1]

  name sex  score
0   aa   男     76

In [41]:
df.score = 60
df

  name sex  score
0   aa   男     60
1   bb   男     60
2   cc   男     60
3   dd   女     60

In [43]:
df['country'] = 'china' 
df

  name sex  score country
0   aa   男     60   china
1   bb   男     60   china
2   cc   男     60   china
3   dd   女     60   china

In [44]:
# DataFrame的索引不能更改，是为了数据的安全性
df.index

RangeIndex(start=0, stop=4, step=1)

In [47]:
df.score[2] = 88
df

d:\software\python\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

  name sex  score country
0   aa   男     60   china
1   bb   男     60   china
2   cc   男     88   china
3   dd   女     60   china

In [48]:
df[df.score>70]

  name sex  score country
2   cc   男     88   china

In [49]:
df[df.sex == '男']

  name sex  score country
0   aa   男     60   china
1   bb   男     60   china
2   cc   男     88   china

In [50]:
df.sex == '男'

0     True
1     True
2     True
3    False
Name: sex, dtype: bool

In [51]:
df[(df.sex=='男')&(df.score>70)]

  name sex  score country
2   cc   男     88   china

In [52]:
df[(df.sex=='男')|(df.score>70)]

  name sex  score country
0   aa   男     60   china
1   bb   男     60   china
2   cc   男     88   china

In [54]:
df.query('(sex=="男" and score>80) or (sex =="女" and score==60 )')

  name sex  score country
2   cc   男     88   china
3   dd   女     60   china

In [55]:
df.score = df.score+1
df

  name sex  score country
0   aa   男     61   china
1   bb   男     61   china
2   cc   男     89   china
3   dd   女     61   china

In [60]:
df1 = pd.DataFrame(np.arange(4).reshape(2,2),columns = ['a','b'])
df2 = pd.DataFrame(np.arange(6).reshape(2,3),columns = ['a','b','c'])

In [63]:
df1

   a  b
0  0  1
1  2  3

In [64]:
df2

   a  b  c
0  0  1  2
1  3  4  5

In [59]:
df1+df2

   a  b   c
0  0  2 NaN
1  5  7 NaN